from ollama import chat


prompt = """你是一位金融领域的实体抽取方面的专家，抽取【输入文本】中的【特定实体】，【输入文本】包含多条数据，以"##"分割，每条数据需要单独分析。并以【指定格式】输出，不允许输出其他字符。

【特定实体】
["日期","股票名称","开盘","收盘价","成交量"]

【指定格式】
[{'日期': ['2023-01-10'], '股票名称': ['古哥-D[EOOE]'], '开盘价': ['100美元'],  '收盘价': ['102美元'], 成交量': ['520000']},{'日期': ['2023.02.17'], '股票名称': ['亚马逊公司 (AMZN)'], '开盘价': ['23美元'],  '收盘价': ['46美元'], 成交量': ['350000']}]

【输入文本】
2023-02-15，寓意吉祥的节日，股票佰笃[BD]美股开盘价10美元，虽然经历了波动，但最终以13美元收盘，
成交量微幅增加至460,000，投资者情绪较为平稳。##2023-04-05，市场迎来轻松氛围，股票盘古(0021)开盘价23元，尽管经历了波动，

但最终以26美元收盘，成交量缩小至310,000，投资者保持观望态度。"""

def predictOne(prompt):
    messages = [
      {
        'role': 'user',
        'content': prompt,
      },
    ]
    response = chat('qwen2.5:7b', messages=messages,options={"temperature":0.0})
    return response['message']['content']

if __name__ == '__main__':
    result = predictOne(prompt)
    print(result)