# 导包
import torch

# 提前设置随机种子,保证数据统一
torch.manual_seed(666)
# 创建张量,用于索引练习
data = torch.randint(1, 10, size=(4, 5), dtype=torch.float32)
print(data)
print(data.shape)
print(data.ndim)
print('=========================================================')
# TODO 索引操作   格式为: 张量[行索引,列索引]
# todo 1.演示单个索引获取数据
# 需求: 获取第2行数据
print(data[1, :])
print(data[1,])
print(data[1])
print('------------')
# 需求: 获取第2列数据
print(data[:, 1])
print(data[..., 1])
print('=========================================================')
# TODO 索引操作   格式为: 张量[行索引,列索引]
# todo 2.演示列表指定多个索引获取数据
# 需求: 获取第1行和第3行数据
print(data[[0, 2], :])
print(data[[0, 2],])
print(data[[0, 2]])
print('------------')
# 需求: 获取第1列和第3列数据
print(data[:, [0, 2]])
print(data[:, [0, 2]])
print('---------------------------')
# todo 演示特殊情况!!!
# 需求: 获取(0,0)和(2,2)两个位置的数据
print(data[[0, 2], [0, 2]])
# 需求: 获取第1行和第3行数据 以及 第1列和第3列 交集数据
print(data[[[0], [2]], [0, 2]])
print('=========================================================')
# TODO 索引操作   格式为: 张量[行索引,列索引]
# todo 3.演示切片获取连续数据
# 需求: 获取张量中前3行数据
print(data[0:3, :])
print(data[0:3, ])
print(data[0:3])
print(data[:3])
print('---------------------')
# 需求: 获取张量中前3列数据
print(data[:, 0:3])
print(data[:, :3])
print('---------------------')
# 需求: 获取前3行3列的数据
print(data[0:3, 0:3])
print(data[:3, :3])
print('---------------------')
# 需求: 观察一下索引操作,说出结果:
print(data[0::2, 0::2])
print('=========================================================')
# TODO 索引操作   格式为: 张量[行索引,列索引]
# todo 4.演示布尔索引获取数据
# 需求: 判断张量中所有数据是否大于5
print(data > 5)
# 需求: 获取张量中所有大于5的数据
print(data[data > 5])
print('---------------')
# 需求: 判断第1行数据是否大于5
print(data[0] > 5)
# 需求: 获取第1行数据大于5的数据
print(data[0][data[0] > 5])
# 需求: 获取第1行数据大于5数据的所在列
print(data[:, data[0] > 5])
print('---------------')
# 需求: 获取第1列数据是否大于5
print(data[:, 0] > 5)
# 需求: 获取第1列数据大于5的数据所在行
print(data[data[:, 0] > 5, :])
print(data[data[:, 0] > 5,])
print(data[data[:, 0] > 5])
