"""02_激活函数"""
"""
softmax特点
值范围:(0,1) 所有的概率和为1
导数范围: 复杂
用途: 主要用于输出层,解决多分类问题
注意: 因为所有的概率和为1,
     最后选择其中最大概率对应作为预测结果
"""
# 导包
import torch
# TODO 示例1
# 准备数据
scores = torch.tensor([0.2, 0.02, 0.15, 0.15, 1.3, 0.5, 0.06, 1.1, 0.05, 3.75])
# 计算softmax结果
# 一般建议结果按照行概率和为1
result = torch.softmax(scores, dim=-1)
print(result) # tensor([0.0212, 0.0177, 0.0202, 0.0202, 0.0638, 0.0287, 0.0185, 0.0522, 0.0183,0.7392])
print(result.sum())
print('===================================================================')
# TODO 示例2
# 创建数据
scores = torch.tensor([[0.3, 0.24, 5, -3.1], [-0.1, 0.56, 2.4, 0.35]] )
# 计算softmax结果
# 一般建议结果按照行概率和为1
result = torch.softmax(scores, dim=-1)
print(result)